app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "phonenumber" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$u02aZTtfs/nNs2YC3wG5deC.x7mvC4a6MUGMP3T239PubRdofhmdu"], ["phonenumber", "123456789"], ["updated_at", "2018-11-23 13:06:46.503035"], ["id", 2]]
---
  def update
    if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_user
    @user=User.find_by_id(params[:id])